In [1]:
RATINGS_DATA_PATH = '../Data/ratings.csv'
MOVIES_DATA_PATH = '../Data/movies.csv'
LINKS_DATA_PATH = '../Data/links.csv'

In [2]:
# ls -l ../Data/ratings.csv

In [3]:
import pandas as pd
ratings_df = pd.read_csv(RATINGS_DATA_PATH)
movies_df = pd.read_csv(MOVIES_DATA_PATH)
links_df = pd.read_csv(LINKS_DATA_PATH)

In [4]:
print(links_df.shape)
links_df.head()

(87585, 3)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [5]:
print(movies_df.shape)
movies_df.head()

(87585, 3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
print(ratings_df.shape)
ratings_df.head()

(32000204, 4)

   userId  movieId  rating  timestamp
0       1       17     4.0  944249077
1       1       25     1.0  944250228
2       1       29     2.0  943230976
3       1       30     5.0  944249077
4       1       32     5.0  943228858

In [7]:
df = ratings_df.merge(movies_df, on='movieId').merge(links_df, on='movieId').head()

In [9]:
df.head()

,userId,movieId,rating,timestamp,title,genres,imdbId,tmdbId
0,1,17,4.0,944249077,Sense and Sensibility (1995),Drama|Romance,114388,4584.0
1,1,25,1.0,944250228,Leaving Las Vegas (1995),Drama|Romance,113627,451.0
2,1,29,2.0,943230976,"City of Lost Children, The (Cité des enfants p...",Adventure|Drama|Fantasy|Mystery|Sci-Fi,112682,902.0
3,1,30,5.0,944249077,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,Crime|Drama,115012,37557.0
4,1,32,5.0,943228858,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller,114746,63.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   userId     5 non-null      int64
 1   movieId    5 non-null      int64
 2   rating     5 non-null      float64
 3   timestamp  5 non-null      int64
 4   title      5 non-null      object
 5   genres     5 non-null      object
 6   imdbId     5 non-null      int64
 7   tmdbId     5 non-null      float64
dtypes: float64(2), int64(4), object(2)
memory usage: 448.0+ bytes

In [10]:
df['title'].str.replace(r"\(.*\)", "").head()

0                         Sense and Sensibility (1995)
1                             Leaving Las Vegas (1995)
2    City of Lost Children, The (Cité des enfants p...
3    Shanghai Triad (Yao a yao yao dao waipo qiao) ...
4            Twelve Monkeys (a.k.a. 12 Monkeys) (1995)
Name: title, dtype: object